spring-ws-core/src/test/resources/org/springframework/ws/soap/soap12/soap12-ill-formed.xml

<env:Envelope xmlns:env='http://www.w3.org/2003/05/soap-envelope'>
    <env:Body>
        <m:alert xmlns:m='http://example.org/alert'>
            <m:msg>Pick up Mary at school at 2pm
        </m:alert>
    </env:Body>
</env:Envelope>